In [2]:
import pandas as pd
from sqlalchemy import create_engine
from pathlib import Path

In [3]:
# Replace BASE_DIR with the actual path to your project directory
BASE_DIR = Path("E:/Labmentrix/Projects/Project_8")

In [5]:
password = "Prince%4011981"
engine = create_engine(
    f"mysql+mysqlconnector://root:{password}@localhost:3306/tourism_db"
)

In [ ]:
df = pd.read_excel(Path(BASE_DIR,r'data/raw/City.xlsx'))
df.to_sql("city", engine, if_exists="append", index=False)

In [7]:
df = pd.read_excel(Path(BASE_DIR,r'data/raw/City.xlsx'))
city = df.copy()

In [8]:
city = df.copy()

In [9]:
import os
os.listdir(r"E:\Labmentrix\Projects\Project_8\data\raw")

['City.xlsx',
 'Continent.xlsx',
 'Country.xlsx',
 'Item.xlsx',
 'Mode.xlsx',
 'Region.xlsx',
 'Transaction.xlsx',
 'Type.xlsx',
 'User.xlsx']

In [13]:
# loading all the data set
continent = pd.read_excel(Path(BASE_DIR,r'data/raw/Continent.xlsx'))
country = pd.read_excel(Path(BASE_DIR,r'data/raw/Country.xlsx'))
item = pd.read_excel(Path(BASE_DIR,r'data/raw/Item.xlsx'))
visit_mode = pd.read_excel(Path(BASE_DIR,r'data/raw/Mode.xlsx'))
region = pd.read_excel(Path(BASE_DIR,r'data/raw/Region.xlsx'))
transaction = pd.read_excel(Path(BASE_DIR,r'data/raw/Transaction.xlsx'))
attraction_type = pd.read_excel(Path(BASE_DIR,r'data/raw/Type.xlsx'))
User = pd.read_excel(Path(BASE_DIR,r'data/raw/User.xlsx'))

In [ ]:
# Importing all the data to mysql Database
continent.to_sql("continent", engine, if_exists="append", index=False)
country.to_sql("country", engine, if_exists="append", index=False)
item.to_sql("item", engine, if_exists="append", index=False)
visit_mode.to_sql("visit_mode", engine, if_exists="append", index=False)
region.to_sql("region", engine, if_exists="append", index=False)
transaction.to_sql("transaction", engine, if_exists="append", index=False)
attraction_type.to_sql("attraction_type", engine, if_exists="append", index=False)
User.to_sql("users", engine, if_exists="append", index=False)

33530

In [17]:
tables = [
    "city",
    "continent",
    "region",
    "country",
    "attraction_type",
    "visit_mode",
    "item",
    "users",
    "transaction"
]

In [18]:
for table in tables:
    df = pd.read_sql(f"SELECT COUNT(*) AS cnt FROM {table}", engine)
    print(table, df["cnt"][0])

city 9143
continent 6
region 22
country 165
city 9143
attraction_type 17
visit_mode 6
item 30
users 33530
transaction 52930

In [ ]:
query="select * from city limit 10"
pd.read_sql(query,engine)

   CityId         CityName  CountryId
0       0                -          0
1       1           Douala          1
2       2     South Region          1
3       3        N'Djamena          2
4       4           Kigali          3
5       5  Kigali Province          3
6       6      Addis Ababa          4
7       7            Karen          5
8       8            Kenya          5
9       9          Malindi          5

In [32]:
transaction.head(2)

,TransactionId,UserId,VisitYear,VisitMonth,VisitMode,AttractionId,Rating
0,3,70456,2022,10,2,640,5
1,8,7567,2022,10,4,640,5

In [39]:
query_join="""
select 
t.TransactionId,
t.UserId,
t.VisitYear,
t.VisitMonth,
t.Rating,

vm.VisitMode,

i.Attraction,
at.AttractionType,
c.CityName, 
co.Country, 
r.Region, 
cn.Continent


from transaction t
LEFT JOIN users u on t.UserId = u.UserID
LEFT Join visit_mode vm on t.VisitMode = vm.VisitMode
LEFT JOIN item i on t.AttractionId = i.AttractionId
LEFT JOIN attraction_type at on i.AttractionTypeId = at.AttractionTypeId
LEFT JOIN city c ON i.AttractionCityId = c.CityId
LEFT JOIN country co ON c.CountryId = co.CountryId
LEFT JOIN region r ON co.RegionId = r.RegionId
LEFT JOIN continent cn ON r.ContinentId = cn.ContinentId

"""

In [40]:
country

     CountryId         Country  RegionId
0            0               -         0
1            1        Cameroon         1
2            2            Chad         1
3            3          Rwanda         1
4            4        Ethiopia         2
..         ...             ...       ...
160        160         Ireland        21
161        161          Monaco        21
162        162     Netherlands        21
163        163  United Kingdom        21
164        164           Yemen        12

[165 rows x 3 columns]

In [41]:
city

      CityId      CityName  CountryId
0          0             -          0
1          1        Douala          1
2          2  South Region          1
3          3     N'Djamena          2
4          4        Kigali          3
...      ...           ...        ...
9138    9138        Yeovil        163
9139    9139          York        163
9140    9140     Yorkshire        163
9141    9141       Zaandam        163
9142    9142         Sanaa        164

[9143 rows x 3 columns]

In [ ]:
pd.read_sql(query_join, engine)

,TransactionId,UserId,VisitYear,VisitMonth,Rating,VisitMode,Attraction,AttractionType,CityName,Country,Region,Continent
0,3,70456,2022,10,5,None,Sacred Monkey Forest Sanctuary,Nature & Wildlife Areas,Douala,Cameroon,Central Africa,Africa
1,8,7567,2022,10,5,None,Sacred Monkey Forest Sanctuary,Nature & Wildlife Areas,Douala,Cameroon,Central Africa,Africa
2,9,79069,2022,10,5,None,Sacred Monkey Forest Sanctuary,Nature & Wildlife Areas,Douala,Cameroon,Central Africa,Africa
3,10,31019,2022,10,3,None,Sacred Monkey Forest Sanctuary,Nature & Wildlife Areas,Douala,Cameroon,Central Africa,Africa
4,15,43611,2022,10,3,None,Sacred Monkey Forest Sanctuary,Nature & Wildlife Areas,Douala,Cameroon,Central Africa,Africa
...,...,...,...,...,...,...,...,...,...,...,...,...
52925,211227,87100,2018,9,4,None,Yogyakarta Palace,Historic Sites,N'Djamena,Chad,Central Africa,Africa
52926,211238,88112,2016,2,5,None,Yogyakarta Palace,Historic Sites,N'Djamena,Chad,Central Africa,Africa
52927,211239,88112,2016,2,4,None,Yogyakarta Palace,Historic Sites,N'Djamena,Chad,Central Africa,Africa
52928,211240,88112,2016,2,4,None,Yogyakarta Palace,Historic Sites,N'Djamena,Chad,Central Africa,Africa
52929,211241,88112,2016,2,5,None,Yogyakarta Palace,Historic Sites,N'Djamena,Chad,Central Africa,Africa

In [18]:
tables

['city',
 'continent',
 'region',
 'country',
 'attraction_type',
 'visit_mode',
 'item',
 'users',
 'transaction']

In [ ]:
city.head(2)

   CityId CityName  CountryId
0       0        -          0
1       1   Douala          1

In [14]:
continent.head(2)

   ContinentId Continent
0            0         -
1            1    Africa

In [15]:
region.head(2)

           Region  RegionId  ContinentId
0               -         0            0
1  Central Africa         1            1

In [16]:
country.head(2)

   CountryId   Country  RegionId
0          0         -         0
1          1  Cameroon         1

In [19]:
attraction_type.head(2)

   AttractionTypeId AttractionType
0                 2  Ancient Ruins
1                10        Ballets

In [20]:
visit_mode.head(2)

   VisitModeId VisitMode
0            0         -
1            1  Business

In [21]:
item.head(2)

,AttractionId,AttractionCityId,AttractionTypeId,Attraction,AttractionAddress
0,369,1,13,Kuta Beach - Bali,Kuta
1,481,1,13,Nusa Dua Beach,"Semenanjung Nusa Dua, Nusa Dua 80517 Indonesia"

In [22]:
User.head(2)

   UserId  ContinentId  RegionId  CountryId  CityId
0      14            5        20        155   220.0
1      16            3        14        101  3098.0

In [23]:
transaction.head(2)

,TransactionId,UserId,VisitYear,VisitMonth,VisitMode,AttractionId,Rating
0,3,70456,2022,10,2,640,5
1,8,7567,2022,10,4,640,5